# PartType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..PartType Property
PipeFittingAndAccessoryData Class See Also
---
The part type of the pipe fitting or pipe accessory.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PartType PartType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PartType As PartType
	Get
```

Visual C++
---
```text
public:
property PartType PartType {
	PartType get ();
}
```

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace